let nationOptionsStr = '汉族、满族、蒙古族、回族、藏族、维吾尔族、苗族、彝族、壮族、布依族、侗族、瑶族、白族、土家族、哈尼族、哈萨克族、傣族、黎族、傈僳族、佤族、畲族、高山族、拉祜族、水族、东乡族、纳西族、景颇族、柯尔克孜族、土族、达斡尔族、仫佬族、羌族、布朗族、撒拉族、毛南族、仡佬族、锡伯族、阿昌族、普米族、朝鲜族、塔吉克族、怒族、乌孜别克族、俄罗斯族、鄂温克族、德昂族、保安族、裕固族、京族、塔塔尔族、独龙族、鄂伦春族、赫哲族、门巴族、珞巴族、基诺族'
export const nationOptions = nationOptionsStr.split('、')

export const politicsStatusOptions = [
    { l:'中共党员', v: '1' },
    { l:'中共预备党员', v: '2' },
    { l:'共青团员', v: '3' },
    { l:'民革会员', v: '4' },
    { l:'民盟盟员', v: '5' },
    { l:'民建会员', v: '6' },
    { l:'民进会员', v: '7' },
    { l:'农工党党员', v: '8' },
    { l:'致公党党员', v: '9' },
    { l:'九三学社社员', v: '10' },
    { l:'台盟盟员', v: '11' },
    { l:'无党派民主人士', v: '12' },
    { l:'群众', v: '13' },
]

export const healthStates = [
    { l: '健康', v: '1' },
    { l: '一般', v: '2' },
    { l: '患病', v: '3' },
    { l: '缺陷', v: '4' },
    { l: '残疾', v: '5' }
]

export const graduateIntentionTypes = [
    { l: '报考硕士研究生', v: '1' },
    { l: '出国留学', v: '2' },
    { l: '实习实训', v: '3' },
    { l: '报考公务员', v: '4' },
    { l: '报考事业单位', v: '5' },
    { l: '大学生村官', v: '6' },
    { l: '选调生', v: '7' },
    { l: '直接就业', v: '8' },
    { l: '自主创业', v: '9' },
    { l: '三支一扶', v: '10' },
    { l: '西部计划', v: '11' },
    { l: '苏北计划', v: '12' },
    { l: '国防生分配', v: '13' },
    { l: '其他', v: '14' }
]

export const registrationStates = [
    { l: '已缴清学费并按规定办理注册', v: '1' },
    { l: '办理学费缓缴手续获批后予以注册', v: '2' },
    { l: '办理生源地助学贷款获批后注册', v: '3' },
    { l: '未按学校规定缴纳学费不予以中蹙额', v: '4' },
    { l: '其他不符合条件的不予注册', v: '5' }
]